tap "homebrew/cask"

# Brew Apps
  brew "aspell"
  brew "awscli"
  brew "git-extras"
  brew "gh"
  brew "git"
  brew "htop"
 # brew "httpie"
  brew "imagemagick"
  brew "jq"
  brew "mas"
  brew "pandoc"
  brew "pick"
  brew "rename"
  brew "shellcheck"
  brew "terraform"
  brew "tmux"
  brew "trash"
  brew "tree"
  brew "unar"
  brew "vim"
  brew "wget"
  brew "youtube-dl"
  brew "htop"
  brew "imagemagick"
  brew "lua"
  brew "nmap"

# Casks
cask_args appdir: "/Applications", require_sha: true
  cask "cakebrew"
  cask "dropbox"
  cask "discord"
  cask "docker"
  cask "joplin"
  cask "flux"
  cask "google-chrome"
 #cask "gpg-suite"
  cask "iterm2"
  cask "keepassxc"
 #cask "slack"
  cask "spotify"
  cask "transmission"
  cask "vlc"
  cask "vscodium"
  cask "wireguard"

# Mac App store (https://github.com/mas-cli/mas)
  mas "Cyberduck", id: 409222199
  mas "Magnet", id: 441258766
 #mas "Microsoft Remote Desktop", id: 715768417
  mas "SomaFM", id: 449155338
 #mas "Textual", id: 896450579
  mas "WireGuard", id: 1451685025
