tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Brew Apps
  brew "aspell"
  brew "awscli"
  brew "bash-completion"
  brew "bash"
  brew "git-extras"
  brew "git"
  brew "htop"
  brew "httpie"
  brew "Imagemagic"
  brew "jq"
  brew "mas"
  brew "pandoc"
  brew "pick"
  brew "rename"
  brew "shellcheck"
  brew "terraform"
  brew "tmux"
  brew "trash"
  brew "tree"
  brew "unrar"
  brew "vim"
  brew "wget"
  brew "youtube-dl"
  brew "htop"
  brew "imagemagick"
  brew "lua"
  brew "nmap"

# Casks
cask_args appdir: "/Applications"
  cask "atom"
  cask "cakebrew"
  cask "dropbox"
  cask "docker"
  cask "evernote"
  cask "flux"
  cask "inkscape"
  cask "google-chrome"
  cask "gpg-suite"
  cask "iterm2"
  cask "keepassxc"
  cask "mathpix-snipping-tool" #OCR math equasions to LaTeX
  cask "slack"
  cask "transmission"
  cask "tunnelblick"
  cask "vlc"
  cask "xquartz"


# Mac App store (https://github.com/mas-cli/mas)
  mas "Cyberduck", id: 409222199
  mas "Magnet", id: 441258766
  mas "Microsoft Remote Desktop", id: 715768417
  mas "SomaFM", id: 449155338
  mas "Textual", id: 896450579
