# Brew Apps
cask_args appdir: "/Applications"
  brew "aspell"
  brew "awscli"
  brew "bash"
  brew "bash-completion"
  brew "git"
  brew "git-extras"
  brew "htop"
  brew "pandoc"
  brew "pick"
  brew "shellcheck"
  brew "tmux"
  brew "trash"
  brew "tree"
  brew "vim"
  brew "wget"
  cask "atom"
  cask "cakebrew"
  cask "dropbox"
  cask "evernote"
  cask "google-chrome"
  cask "gpg-suite"
  cask "iterm2"
  cask "keepassxc"
  cask "slack"
  cask "steam"
  cask "transmission"
  cask "vlc"
